Revit 2027 API
ExternalResourceServiceUtils.GetServersByType Method
 Gets registered external resource servers which support the external resource type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IExternalResourceServer> GetServersByType(
	ExternalResourceType type
)
Public Shared Function GetServersByType (
	type As ExternalResourceType
) As IList(Of IExternalResourceServer)
public:
static IList<IExternalResourceServer^>^ GetServersByType(
	ExternalResourceType^ type
)
static member GetServersByType :
        type : ExternalResourceType -> IList<IExternalResourceServer>
Parameters
type ExternalResourceType
 The external resource type for the servers to match
Return Value
IList<IExternalResourceServer>
 A list of matched external resource servers
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceServiceUtils Class
Autodesk.Revit.DB Namespace